Alset-Innovations/STM32-Code-Source/Black Pill Code/Commutation/Core/Src/main.c
}

HAL_StatusTypeDef StopSequence() {

	// Stop HallSensor timer
	HAL_TIMEx_HallSensor_Stop (&htim2);

	// Disable all output channels
	TIM1->CCER  = 0x0000;
	TIM1->CCMR1 = 0x0000;
	TIM1->CCMR2 = 0x0000;

	// Disable commutation events if not already disabled
	if ( (TIM1->DIER & TIM_DIER_COMIE) >= 1 ) { 	// If COMIE bit in DIER is set commutation events are still enabled

		TIM1->EGR |= TIM_EGR_COMG; 							// Trigger commutation event
		// while ( (TIM1->SR & TIM_SR_COMIF) >= 1 ); 	// Wait until commutation event has happened
		TIM1->DIER &= ~TIM_DIER_COMIE; 						// Disable commutation events in DIER register

	}

	// Stop interrupts
	HAL_TIM_Base_Stop_IT (&htim1);
	HAL_TIM_Base_Stop_IT (&htim2);
	HAL_TIM_Base_Stop_IT (&htim9);
	HAL_TIM_IC_Stop_IT (&htim9, TIM_CHANNEL_2);

	// Stop PWM Timers
	HAL_TIM_PWM_Stop (&htim1, TIM_CHANNEL_1);
	HAL_TIM_PWM_Stop (&htim1, TIM_CHANNEL_2);
	HAL_TIM_PWM_Stop (&htim1, TIM_CHANNEL_3);

	Registers[RPMReg] = 0;

	return HAL_OK;

}

void ProcessData (void) {

	StartReg = RxData[0]; 			// Start address of registers to be written
	NumReg = RxCount - 1; 			// Number of registers to be written
	EndReg = StartReg + NumReg - 1; // Last register to be written

	// If the last register to be wriiten is larger than the size of the register call the error handler
	if (EndReg > RxSize) {
		Error_Handler();
	}

	// Write data into the register using a for loop
	for (int i = 1; i < NumReg + 1; i++) {
		Registers[StartReg++] = RxData[i + 1];
	}

	// If the PWM is higher than 0 but the motor is not turning then startup
	if ( Registers[PWMReg] > 0 && Registers[RPMReg] <= 0) {
		StartupSequence(Registers[DirReg]);
	}

	// If the PWM is 0 or negative but the motor is still turning shutdown
	if ( Registers[PWMReg] <= 0 && Registers[RPMReg] > 0 ) {
		StopSequence();
	}

	// Update PWM values
	if ( Registers[PWMReg] >= 0 ) {

		uint32_t PWM = (Registers[PWMReg] * TIM1->ARR) / 100; // Calculate required CCRx value

		if (PWM >= TIM1->ARR - 60) {
			PWM = TIM1->ARR - 60;
		}

		TIM1->CR1 |= TIM_CR1_UDIS; 	// Disable Update Events
		TIM1->CCR1 = PWM;	  		// Set new PWM for channel 1
		TIM1->CCR2 = PWM;	  		// Set new PWM for channel 2
		TIM1->CCR3 = PWM;	  		// Set new PWM for channel 3
		TIM1->CR1 &= ~TIM_CR1_UDIS; // Enable Update Events

	}

	// Empty the RxData array
	memset(RxData, 0, RxSize);

}

extern void HAL_I2C_ListenCpltCallback (I2C_HandleTypeDef *hi2c) {

	HAL_I2C_EnableListen_IT (hi2c);

}

extern void HAL_I2C_AddrCallback (I2C_HandleTypeDef *hi2c, uint8_t TransferDirection, uint16_t AddrMatchCode) {

	if ( TransferDirection == I2C_DIRECTION_TRANSMIT ) { // If the master wants to transmit the data

		RxCount = 0;
		HAL_I2C_Slave_Sequential_Receive_IT (hi2c, RxData + RxCount, 1, I2C_FIRST_FRAME);

	} else { // If the master wants tot recieve data

		TxCount = 0;
		StartReg = RxData[0];
		HAL_I2C_Slave_Seq_Transmit_IT (hi2c, Registers[TxCount + StartReg] >> 8, 1, I2C_FIRST_FRAME);
		HAL_I2C_Slave_Seq_Transmit_IT (hi2c, Registers[TxCount + StartReg], 1, I2C_NEXT_FRAME);

	}
}

void HAL_I2C_SlaveTxCpltCallback (I2C_HandleTypeDef *hi2c) {

	TxCount++;
	HAL_I2C_Slave_Seq_Transmit_IT (hi2c, Registers[TxCount + StartReg] >> 8, 1, I2C_NEXT_FRAME);
	HAL_I2C_Slave_Seq_Transmit_IT (hi2c, Registers[TxCount + StartReg], 1, I2C_NEXT_FRAME);

}

void HAL_I2C_SlaveRxCpltCallback (I2C_HandleTypeDef *hi2c) {

	RxCount++;

	if ( RxCount < RxSize ) {

		if (RxCount == RxSize - 1) {
			HAL_I2C_Slave_Sequential_Receive_IT (hi2c, RxData + RxCount, 1, I2C_LAST_FRAME);
		} else {
			HAL_I2C_Slave_Sequential_Receive_IT (hi2c, RxData + RxCount, 1, I2C_NEXT_FRAME);
		}
	}

	if ( RxCount == RxSize) {
		ProcessData();
	}

}

void HAL_I2C_ErrorCallback (I2C_HandleTypeDef *hi2c) {

	if ( HAL_I2C_GetError (hi2c) == 4) {

		__HAL_I2C_CLEAR_FLAG (hi2c, I2C_FLAG_AF); 	// Clear AF flag

		if ( TxCount == 0) { 						// Error while recieving
			ProcessData();
		} else { 									// Error while transmitting
			TxCount--;
		}

	}

	HAL_I2C_EnableListen_IT(hi2c);
}

extern uint8_t CDC_Transmit_FS (uint8_t* buf, uint16_t len);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();
  MX_TIM1_Init();
  MX_SPI1_Init();
  MX_TIM2_Init();
  MX_TIM9_Init();
  MX_I2C1_Init();
  MX_USB_DEVICE_Init();
  MX_USART1_UART_Init();
  /* USER CODE BEGIN 2 */

	StartupSequence (Registers[DirReg]);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

	/*
	// Read Potentiometer data from ADC for RPM control.
	HAL_ADC_Start(&hadc1);
	HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY);
	uint32_t PWM = HAL_ADC_GetValue(&hadc1) / 2;

	if (PWM >= TIM1->ARR - 60) {
		PWM = TIM1->ARR - 60;
	}

	TIM1->CR1 |= TIM_CR1_UDIS; 	// Disable Update Events
	TIM1->CCR1 = PWM;	  		// Set new PWM for channel 1
	TIM1->CCR2 = PWM;	  		// Set new PWM for channel 2
	TIM1->CCR3 = PWM;	  		// Set new PWM for channel 3
	TIM1->CR1 &= ~TIM_CR1_UDIS; // Enable Update Events
	*/

	/*
	// Transmit RPM value to PC via USB
	len = snprintf(buf, sizeof(buf), "\n\rCurrent PWM: %4d", PWM);
	CDC_Transmit_FS ((uint8_t *) buf, len);

	HAL_Delay(10);
	*/

	// Update RPM
	// Disable UDIS in CR1
	// Change DC
	// Enable UDIS in CR1

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

